qnimble/arduino_boards/boards.txt
menu.usb=USB Type
menu.speed=CPU Speed
menu.opt=Optimize
menu.keys=Keyboard Layout

quarto.name=Quarto
quarto.upload.maximum_size=7864320
quarto.upload.maximum_data_size=524288
quarto.upload.tool=qbossa
quarto.upload.protocol=sam-ba
quarto.upload.use_1200pbs_touch=true
quarto.upload.native_usb=true
quarto.build.board=Quarto
quarto.vid.0=0x1781
quarto.pid.0=0x0941
quarto.build.core=imxrt
quarto.build.mcu=imxrt1062
quarto.build.variant=quarto
quarto.build.warn_data_percentage=99
quarto.build.toolchain=
quarto.build.command.gcc=arm-none-eabi-gcc
quarto.build.command.g++=arm-none-eabi-g++
quarto.build.command.ar=arm-none-eabi-gcc-ar
quarto.build.command.objcopy=arm-none-eabi-objcopy
quarto.build.command.objdump=arm-none-eabi-objdump
quarto.build.command.linker=arm-none-eabi-gcc
quarto.build.command.size=arm-none-eabi-size
quarto.build.flags.common=-g -Wall -ffunction-sections -fdata-sections -nostdlib
quarto.build.flags.dep=-MMD
quarto.build.flags.optimize=-O2
quarto.build.flags.cpu=-mthumb -mcpu=cortex-m7 -mfloat-abi=hard -mfpu=fpv5-d16
quarto.build.flags.defs=-D__IMXRT1062__ -DARDUINO_QUARTO
quarto.build.flags.cpp=-std=gnu++14 -fno-exceptions -fpermissive -fno-rtti -fno-threadsafe-statics -felide-constructors -Wno-error=narrowing
quarto.build.flags.c=
quarto.build.flags.S=-x assembler-with-cpp
quarto.build.flags.ld=-Wl,--gc-sections,--relax "-T{build.core.path}/quarto_arduino.ld"
quarto.build.flags.libs=-larm_cortexM7lfdp_math -larm_cortexM7lfsp_math -lm -lc_nano -lnosys -u _printf_float -u _scanf_float
quarto.build.fcpu=528000000
quarto.build.usbtype=USB_SERIAL
quarto.build.keylayout=US_ENGLISH
quarto.serial.restart_cmd=false

quarto.menu.opt.o2std=Faster
quarto.menu.opt.o2std.build.flags.optimize=-O2
quarto.menu.opt.o2std.build.flags.ldspecs=

quarto.menu.opt.o1std=Fast
quarto.menu.opt.o1std.build.flags.optimize=-O1
quarto.menu.opt.o1std.build.flags.ldspecs=

quarto.menu.opt.o3std=Fastest
quarto.menu.opt.o3std.build.flags.optimize=-O3
quarto.menu.opt.o3std.build.flags.ldspecs=

quarto.menu.opt.ogstd=Debug
quarto.menu.opt.ogstd.build.flags.optimize=-Og
quarto.menu.opt.ogstd.build.flags.ldspecs=

quarto.menu.opt.osstd=Smallest Code
quarto.menu.opt.osstd.build.flags.optimize=-Os --specs=nano.specs
quarto.menu.opt.osstd.build.flags.ldspecs=

quarto.menu.opt.osstd=No Optimization
quarto.menu.opt.osstd.build.flags.optimize=-O0
quarto.menu.opt.osstd.build.flags.ldspecs=
